import React from 'react'
import { Human } from './Human'
import s from './home.module.css'
import { Parallax } from 'react-parallax';
import img from './img/1.jpg'
import img2 from './img/2.jpg'
import {CreateResume} from '../Resume/CreateResume/CreateResume'
import { NavLink } from "react-router-dom";
import {
    BrowserView,
    MobileView
} from "react-device-detect";


export const Home = () => {
    return (
        <div className={s.home__page}>

            <BrowserView>
                <Parallax bgImage={img} strength={700}>
                    <div className={s.header__conteiner}>
                        <Human />
                        <div className={s.header__button}>
                            <h1>
                                Створіть своє професійне резюме тут
                            </h1>
                            <button>Створити своє резюме</button>
                            <p>У Вас буде на 65% більше шансів отримати роботу</p>
                        </div>
                    </div>
                </Parallax>
            </BrowserView>
            <MobileView>
            <Parallax bgImage={img} strength={700}>
                    <div className={s.header__conteiner}>
                        <h1>
                            Створіть своє професійне резюме тут
                        </h1>
                        <Human />
                        <NavLink to='/resume/create'>
                            <button>Створити своє резюме</button>
                        </NavLink>
                        <p>У Вас буде на 65% більше шансів отримати роботу</p>
                    </div>
                </Parallax>
            </MobileView>

            <BrowserView>
                <div className={s.advice__blocks}>
                    <div>
                        <svg className={s.galochka} id="Capa_1" enable-background="new 0 0 512 512" viewBox="0 0 512 512" width="70" xmlns="http://www.w3.org/2000/svg"><g><path d="m256 0c-141.488 0-256.001 114.496-256 256 0 141.491 114.497 256 256 256 141.488 0 256.001-114.496 256-256 0-141.491-114.497-256-256-256zm159.806 415.807c-88.117 88.117-231.495 88.117-319.612 0v-.001c-88.117-88.117-88.117-231.494 0-319.612 88.326-88.325 231.28-88.331 319.613.001 88.116 88.117 88.116 231.493-.001 319.612z"/><path d="m406.051 144.903c-23.542-23.543-61.755-23.433-85.157.306l-93.4 94.749-36.692-36.692c-23.449-23.449-61.401-23.453-84.853 0-23.394 23.393-23.394 61.458 0 84.853 60.789 60.788 43.397 43.436 78.438 78.456 24.108 24.096 63.326 24.083 87.42-.012 33.453-33.453 134.551-137.114 134.551-137.114 23.056-23.393 22.918-61.32-.307-84.546zm-21.059 63.487c-112.947 114.598-134.398 136.96-134.398 136.96-12.405 12.405-32.592 12.407-45 .006 0 0-73.179-73.197-78.432-78.45-11.697-11.697-11.697-30.73 0-42.427 11.726-11.726 30.7-11.725 42.426 0l47.376 47.375c5.889 5.889 15.446 5.851 21.289-.076l104.005-105.508c11.688-11.856 30.796-11.937 42.579-.153 11.613 11.612 11.683 30.576.155 42.273z"/></g></svg>
                        <div className={s.hdr__descrpt}>
                            <h2>ШВИДКО І ЛЕГКО</h2>
                            <p>
                                З нашим онлайн-конструктором резюме, будь-яка людина може швидко створити професійне резюме. Введіть свої особисті дані та почніть заповнювати резюме. Насамкінець, виберіть один з 36 доступних шаблонів і завантажте Ваше резюме.
                            </p>
                        </div>
                    </div>
                    
                    <div>
                        <svg className={s.galochka} id="Capa_1" enable-background="new 0 0 512 512" viewBox="0 0 512 512" width="70" xmlns="http://www.w3.org/2000/svg"><g><path d="m256 0c-141.488 0-256.001 114.496-256 256 0 141.491 114.497 256 256 256 141.488 0 256.001-114.496 256-256 0-141.491-114.497-256-256-256zm159.806 415.807c-88.117 88.117-231.495 88.117-319.612 0v-.001c-88.117-88.117-88.117-231.494 0-319.612 88.326-88.325 231.28-88.331 319.613.001 88.116 88.117 88.116 231.493-.001 319.612z"/><path d="m406.051 144.903c-23.542-23.543-61.755-23.433-85.157.306l-93.4 94.749-36.692-36.692c-23.449-23.449-61.401-23.453-84.853 0-23.394 23.393-23.394 61.458 0 84.853 60.789 60.788 43.397 43.436 78.438 78.456 24.108 24.096 63.326 24.083 87.42-.012 33.453-33.453 134.551-137.114 134.551-137.114 23.056-23.393 22.918-61.32-.307-84.546zm-21.059 63.487c-112.947 114.598-134.398 136.96-134.398 136.96-12.405 12.405-32.592 12.407-45 .006 0 0-73.179-73.197-78.432-78.45-11.697-11.697-11.697-30.73 0-42.427 11.726-11.726 30.7-11.725 42.426 0l47.376 47.375c5.889 5.889 15.446 5.851 21.289-.076l104.005-105.508c11.688-11.856 30.796-11.937 42.579-.153 11.613 11.612 11.683 30.576.155 42.273z"/></g></svg>
                        <div className={s.hdr__descrpt}>
                            <h2>БІЛЬШЕ ШАНСІВ ОТРИМАТИ РОБОТУ</h2>
                            <p>                            
                                Репрезентативне, професійне резюме виділить Вас серед всіх інших претендентів. Імовірність того, що Вас запросять на співбесіду, також підвищиться на 65%.
                            </p>
                        </div>
                    </div>
                    <div>
                        <svg className={s.galochka} id="Capa_1" enable-background="new 0 0 512 512" viewBox="0 0 512 512" width="70" xmlns="http://www.w3.org/2000/svg"><g><path d="m256 0c-141.488 0-256.001 114.496-256 256 0 141.491 114.497 256 256 256 141.488 0 256.001-114.496 256-256 0-141.491-114.497-256-256-256zm159.806 415.807c-88.117 88.117-231.495 88.117-319.612 0v-.001c-88.117-88.117-88.117-231.494 0-319.612 88.326-88.325 231.28-88.331 319.613.001 88.116 88.117 88.116 231.493-.001 319.612z"/><path d="m406.051 144.903c-23.542-23.543-61.755-23.433-85.157.306l-93.4 94.749-36.692-36.692c-23.449-23.449-61.401-23.453-84.853 0-23.394 23.393-23.394 61.458 0 84.853 60.789 60.788 43.397 43.436 78.438 78.456 24.108 24.096 63.326 24.083 87.42-.012 33.453-33.453 134.551-137.114 134.551-137.114 23.056-23.393 22.918-61.32-.307-84.546zm-21.059 63.487c-112.947 114.598-134.398 136.96-134.398 136.96-12.405 12.405-32.592 12.407-45 .006 0 0-73.179-73.197-78.432-78.45-11.697-11.697-11.697-30.73 0-42.427 11.726-11.726 30.7-11.725 42.426 0l47.376 47.375c5.889 5.889 15.446 5.851 21.289-.076l104.005-105.508c11.688-11.856 30.796-11.937 42.579-.153 11.613 11.612 11.683 30.576.155 42.273z"/></g></svg>
                        <div className={s.hdr__descrpt}>
                            <h2>ВПОРЯДКУЙТЕ СВОЇ ЗАЯВКИ</h2>
                            <p>
                                Часто важливо мати можливість адаптувати своє резюме в залежності від вакансії, на яку Ви хочете подати заявку. Наш конструктор дозволяє створювати і редагувати одразу декілька резюме, які впорядковано зберігаються у Вашому особистому кабінеті.
                            </p>
                        </div>
                    </div>
                </div>
            </BrowserView>
            <MobileView>
                <div className={s.advice__blocks}>
                    <div>
                        <div className={s.galochka__hdr}>
                            <svg className={s.galochka} id="Capa_1" enable-background="new 0 0 512 512" viewBox="0 0 512 512" width="70" xmlns="http://www.w3.org/2000/svg"><g><path d="m256 0c-141.488 0-256.001 114.496-256 256 0 141.491 114.497 256 256 256 141.488 0 256.001-114.496 256-256 0-141.491-114.497-256-256-256zm159.806 415.807c-88.117 88.117-231.495 88.117-319.612 0v-.001c-88.117-88.117-88.117-231.494 0-319.612 88.326-88.325 231.28-88.331 319.613.001 88.116 88.117 88.116 231.493-.001 319.612z"/><path d="m406.051 144.903c-23.542-23.543-61.755-23.433-85.157.306l-93.4 94.749-36.692-36.692c-23.449-23.449-61.401-23.453-84.853 0-23.394 23.393-23.394 61.458 0 84.853 60.789 60.788 43.397 43.436 78.438 78.456 24.108 24.096 63.326 24.083 87.42-.012 33.453-33.453 134.551-137.114 134.551-137.114 23.056-23.393 22.918-61.32-.307-84.546zm-21.059 63.487c-112.947 114.598-134.398 136.96-134.398 136.96-12.405 12.405-32.592 12.407-45 .006 0 0-73.179-73.197-78.432-78.45-11.697-11.697-11.697-30.73 0-42.427 11.726-11.726 30.7-11.725 42.426 0l47.376 47.375c5.889 5.889 15.446 5.851 21.289-.076l104.005-105.508c11.688-11.856 30.796-11.937 42.579-.153 11.613 11.612 11.683 30.576.155 42.273z"/></g></svg>
                            <h2>ШВИДКО І ЛЕГКО</h2>
                        </div>
                        <p>
                            З нашим онлайн-конструктором резюме, будь-яка людина може швидко створити професійне резюме. Введіть свої особисті дані та почніть заповнювати резюме. Насамкінець, виберіть один з 36 доступних шаблонів і завантажте Ваше резюме.
                        </p>
                    </div>
                    
                    <div>
                        <div className={s.galochka__hdr}>
                            <svg className={s.galochka} id="Capa_1" enable-background="new 0 0 512 512" viewBox="0 0 512 512" width="70" xmlns="http://www.w3.org/2000/svg"><g><path d="m256 0c-141.488 0-256.001 114.496-256 256 0 141.491 114.497 256 256 256 141.488 0 256.001-114.496 256-256 0-141.491-114.497-256-256-256zm159.806 415.807c-88.117 88.117-231.495 88.117-319.612 0v-.001c-88.117-88.117-88.117-231.494 0-319.612 88.326-88.325 231.28-88.331 319.613.001 88.116 88.117 88.116 231.493-.001 319.612z"/><path d="m406.051 144.903c-23.542-23.543-61.755-23.433-85.157.306l-93.4 94.749-36.692-36.692c-23.449-23.449-61.401-23.453-84.853 0-23.394 23.393-23.394 61.458 0 84.853 60.789 60.788 43.397 43.436 78.438 78.456 24.108 24.096 63.326 24.083 87.42-.012 33.453-33.453 134.551-137.114 134.551-137.114 23.056-23.393 22.918-61.32-.307-84.546zm-21.059 63.487c-112.947 114.598-134.398 136.96-134.398 136.96-12.405 12.405-32.592 12.407-45 .006 0 0-73.179-73.197-78.432-78.45-11.697-11.697-11.697-30.73 0-42.427 11.726-11.726 30.7-11.725 42.426 0l47.376 47.375c5.889 5.889 15.446 5.851 21.289-.076l104.005-105.508c11.688-11.856 30.796-11.937 42.579-.153 11.613 11.612 11.683 30.576.155 42.273z"/></g></svg>
                            <h2>БІЛЬШЕ ШАНСІВ ОТРИМАТИ РОБОТУ</h2>
                        </div>
                        <p>                            
                            Репрезентативне, професійне резюме виділить Вас серед всіх інших претендентів. Імовірність того, що Вас запросять на співбесіду, також підвищиться на 65%.
                        </p>
                    </div>
                    <div>
                    <div className={s.galochka__hdr}>
                        <svg className={s.galochka} id="Capa_1" enable-background="new 0 0 512 512" viewBox="0 0 512 512" width="70" xmlns="http://www.w3.org/2000/svg"><g><path d="m256 0c-141.488 0-256.001 114.496-256 256 0 141.491 114.497 256 256 256 141.488 0 256.001-114.496 256-256 0-141.491-114.497-256-256-256zm159.806 415.807c-88.117 88.117-231.495 88.117-319.612 0v-.001c-88.117-88.117-88.117-231.494 0-319.612 88.326-88.325 231.28-88.331 319.613.001 88.116 88.117 88.116 231.493-.001 319.612z"/><path d="m406.051 144.903c-23.542-23.543-61.755-23.433-85.157.306l-93.4 94.749-36.692-36.692c-23.449-23.449-61.401-23.453-84.853 0-23.394 23.393-23.394 61.458 0 84.853 60.789 60.788 43.397 43.436 78.438 78.456 24.108 24.096 63.326 24.083 87.42-.012 33.453-33.453 134.551-137.114 134.551-137.114 23.056-23.393 22.918-61.32-.307-84.546zm-21.059 63.487c-112.947 114.598-134.398 136.96-134.398 136.96-12.405 12.405-32.592 12.407-45 .006 0 0-73.179-73.197-78.432-78.45-11.697-11.697-11.697-30.73 0-42.427 11.726-11.726 30.7-11.725 42.426 0l47.376 47.375c5.889 5.889 15.446 5.851 21.289-.076l104.005-105.508c11.688-11.856 30.796-11.937 42.579-.153 11.613 11.612 11.683 30.576.155 42.273z"/></g></svg>
                        <h2>ВПОРЯДКУЙТЕ СВОЇ ЗАЯВКИ</h2>
                    </div>
                        <p>
                            Часто важливо мати можливість адаптувати своє резюме в залежності від вакансії, на яку Ви хочете подати заявку. Наш конструктор дозволяє створювати і редагувати одразу декілька резюме, які впорядковано зберігаються у Вашому особистому кабінеті.
                        </p>
                    </div>
                </div>
                </MobileView>
            

            <Parallax className={s.last__block} bgImage={img2} strength={700}>
                <NavLink to='/resume/create'>
                    <button>Створити своє резюме</button>
                </NavLink>
            </Parallax>
        </div>
    )
}
